server/app/controllers/hashtags_controller.rb

SELECT  hashtags.name, count(hashtag_id) as "hashtag_count" FROM "hashtags" INNER JOIN "tweet_tags" ON "tweet_tags"."hashtag_id" = "hashtags"."id" GROUP BY hashtags.id  ORDER BY hashtag_count desc LIMIT 10
---
  def popular
    hashtags = Hashtag.joins(:tweet_tags)
              .select('hashtags.name, count(hashtag_id) as "hashtag_count"')
              .group("hashtags.id")
              .order('hashtag_count desc')
              .limit(10)