server/app/controllers/tweets_controller.rb

  def recent
    Tweet.ordered_json
---
SELECT "tweets".* FROM "tweets"

  def create
    params.permit!
    tweet = Tweet.new(params[:tweet])
    tweet.content ||= Faker::Lorem.sentence
    tweet.username ||= Faker::Name.name
    tweet.handle ||= "@" + Faker::Internet.user_name
    tweet.avatar_url ||= Faker::Avatar.image(tweet.username)
    tweet.save

    hashtags_names = params[:hashtags] || []
    hashtags_names.each do |name|
      tweet.hashtags << Hashtag.first_or_create(name: name)
---
INSERT INTO "tweets" ("avatar_url", "content", "created_at", "handle", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "hashtags".* FROM "hashtags"  WHERE "hashtags"."name" = '@korn' LIMIT 1
INSERT INTO "hashtags" ("name") VALUES (?)  [["name", "@korn"]]
SELECT "hashtags"."name" FROM "hashtags" INNER JOIN "tweet_tags" ON "hashtags"."id" = "tweet_tags"."hashtag_id" WHERE "tweet_tags"."tweet_id" = ?  [["tweet_id", 51]]